In [1]:
import pandas as pd
import numpy as np
import datetime as dt

In [2]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [3]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [4]:
np.sqrt(df)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [8]:
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

In [9]:
df.apply(np.sum,axis=1)

0    13
1    13
2    13
dtype: int64

In [12]:
df.apply(lambda x: [1,2],axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [17]:
display(df,df.apply(lambda x: [1,2],axis=1),df.apply(lambda x: [1,2],axis=1,result_type="expand"))

   A  B
0  4  9
1  4  9
2  4  9

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

   0  1
0  1  2
1  1  2
2  1  2

In [15]:
df.apply(lambda x: [1,2],axis=1,result_type="expand") # expand liste benzeri sonuçları Dataframe e genişletir

   0  1
0  1  2
1  1  2
2  1  2

In [18]:
df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2

In [10]:
display(df["A"].nunique(), df['A'].unique)

1

<bound method Series.unique of 0    4
1    4
2    4
Name: A, dtype: int64>

In [11]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [14]:
df1 = pd.read_csv("Salaries.csv")

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [26]:
df1["TotalPay"].value_counts().head()

0.0         368
18594.0      82
123290.7     56
132242.5     49
105489.0     42
Name: TotalPay, dtype: int64

In [27]:
df1["TotalPay"].value_counts().tail()

 83836.25    1
 83710.91    1
 83283.97    1
 83425.21    1
-618.13      1
Name: TotalPay, dtype: int64

In [17]:
df1["JobTitle"].value_counts()[-5::1] # enaz 5 meslek

CHIEF HOUSING INSPECTOR                           1
TRAFFIC SIGNAL OPERATOR                           1
COURT COMPUTER FACILITIES COORDINATOR             1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I    1
VICTIM & WITNESS TECHNICIAN                       1
Name: JobTitle, dtype: int64

In [30]:
a = pd.DataFrame(df1["JobTitle"].sort_values())
a

                  JobTitle
24456        ACCOUNT CLERK
35637        ACCOUNT CLERK
26437        ACCOUNT CLERK
24574        ACCOUNT CLERK
26235        ACCOUNT CLERK
...                    ...
98074   Youth Comm Advisor
138458  Youth Comm Advisor
103333  Youth Comm Advisor
58842   Youth Comm Advisor
18778          ZOO CURATOR

[148654 rows x 1 columns]

In [31]:
train = pd.read_csv("http://bit.ly./kaggletrain")
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [34]:
train["Sex_num"] = train.Sex.map({"female" : 0, "male" : 1})

In [35]:
train.loc[0:4,["Sex","Sex_num"]]

      Sex  Sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [36]:
train["Name_length"] = train.Name.apply(len)

In [40]:
train.loc[0:4,["Name","Name_length"]]

                                                Name  Name_length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [41]:
train["Fare_cell"] = train.Fare.apply(np.ceil)

In [42]:
train.loc[0:4,["Fare", "Fare_cell"]]

      Fare  Fare_cell
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0

In [43]:
train.Name.str.split(",").head()

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [44]:
def get_element(my_list,position):
    return my_list[position]

In [47]:
train.Name.str.split(",").apply(get_element,position=0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [48]:
train.Name.str.split(",").apply(lambda x: x[0]).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [49]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")

In [50]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [53]:
drinks.loc[:,"beer_servings":"wine_servings"].apply(max,axis=0)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [54]:
drinks.loc[:,"beer_servings":"wine_servings"].apply(max,axis=1)

0        0
1      132
2       25
3      312
4      217
      ...
188    333
189    111
190      6
191     32
192     64
Length: 193, dtype: int64

In [55]:
drinks.loc[:,"beer_servings":"wine_servings"].apply(np.argmax,axis=1)

0      0
1      1
2      0
3      2
4      0
      ..
188    0
189    0
190    0
191    0
192    0
Length: 193, dtype: int64

In [56]:
drinks.loc[:,"beer_servings":"wine_servings"].applymap(float)

     beer_servings  spirit_servings  wine_servings
0              0.0              0.0            0.0
1             89.0            132.0           54.0
2             25.0              0.0           14.0
3            245.0            138.0          312.0
4            217.0             57.0           45.0
..             ...              ...            ...
188          333.0            100.0            3.0
189          111.0              2.0            1.0
190            6.0              0.0            0.0
191           32.0             19.0            4.0
192           64.0             18.0            4.0

[193 rows x 3 columns]

In [57]:
drinks.loc[:,"beer_servings":"wine_servings"] = drinks.loc[:,"beer_servings":"wine_servings"].applymap(float)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0.0,0.0,0.0,Asia
1,Albania,89.0,132.0,54.0,4.9,Europe
2,Algeria,25.0,0.0,14.0,0.7,Africa
3,Andorra,245.0,138.0,312.0,12.4,Europe
4,Angola,217.0,57.0,45.0,5.9,Africa